app/Controllers/ArticulosController.php

SELECT *
FROM `articulos`
---
    public function index()
    {
        $data['articulos'] = $this->articulosModel->findAll();

SELECT *
FROM `articulos`
WHERE `articulos`.`id` = '1'
---
    public function editar($id)
    {
        $articulo = $this->articulosModel->find($id);

SELECT *
FROM `articulos`
WHERE `articulos`.`id` = '2'
UPDATE `articulos` SET `meta_title` = 'hola bolaaa', `meta_description` = 'bola', `title` = 'jsjsjsjsj', `description` = 'hola mi amor', `content` = 'dtyuirjkkjkjkjkjkjkjkjkjkjj', `schedule_date` = '2024-04-13', `updated_at` = '2024-04-05 15:06:45'
WHERE `articulos`.`id` IN ('1')
---
    public function actualizar()
    {
        $id = $this->request->getVar('id');
        $articuloExistente = $this->articulosModel->find($id);

        $data = [
            'meta_title' => $this->request->getVar('meta_title'),
            'meta_description' => $this->request->getVar('meta_description'),
            'title' => $this->request->getVar('title'),
            'description' => $this->request->getVar('description'),
            'content' => $this->request->getVar('content'),
            'schedule_date' => $this->request->getVar('schedule_date'),
        ];

        $file = $this->request->getFile('image');
        if ($file !== null && $file->isValid() && !$file->hasMoved()) {

            if (!empty($articuloExistente['image'])) {
                $rutaimageAnterior = FCPATH . 'storage/' . $articuloExistente['image'];
                if (file_exists($rutaimageAnterior)) {
                    unlink($rutaimageAnterior);
                }
            }

            // Procesa la nueva image
            $newName = date('dmY') . '_' . $file->getName();
            $file->move(FCPATH . 'storage', $newName);
            $data['image'] = $newName;
        }

        $this->articulosModel->update($id, $data);