app/Controllers/Home.php

SELECT *
FROM `articulos`
---
    public function index(): string
    {
        $data['articulos'] = $this->articulosModel->findAll();

SELECT *
FROM `articulos`
WHERE `articulos`.`id` = '8'
---
    public function tendenciaActual($id)
    {
        $articulo = $this->articulosModel->find($id);